#ifndef PF_H
#define PF_H

#include "coruna.h"
#include "kexploit.h"

typedef struct {
    KctxTargetObj3 *owner;                  // +0x00
    uint64_t        fileoff;                // +0x08
    uint64_t        filesize;               // +0x10
    KctxTargetObj3 *owner2;                 // +0x18
    uint64_t        vmaddr;                 // +0x20
    uint64_t        vmsize;                 // +0x28
    struct segment_command_64 *seg_cmd;     // +0x30
} SegmentInfo;                              // sizeof = 0x38

typedef struct {
    KctxTargetObj3 *kctxto3;    // +0x00: source context (NULL = not found)
    uint64_t sect_addr;          // +0x08: section.addr (rebased)
    uint64_t sect_size;          // +0x10: section.size
} MachOSectionResult;

typedef struct {
    uint64_t base;
    uint64_t start;
    uint64_t size;
} ScanRegion;

bool maybe_setup_kread_page_cache(KctxTargetObj3 *kctxto3);
MachOSectionResult find_macho_section(KctxTargetObj3 *kctxto3,
                                       const char *segname,
                                       const char *sectname);
uint64_t parse_macho_header(KctxTargetObj3 *kctxto3, uint64_t macho_base);
bool init_pf_macho_context(KctxTargetObj3 *kctxto3, int idk,
                            uint64_t kernel_base, uint64_t flags);
bool init_pf_macho_context_wrapper_with_setflag_0x100(KctxTargetObj3 *kctxto3, int idk, uint64_t macho_base, uint64_t flags);                            
void init_kctxto3(KctxTargetObj3 *kctxto3, CorunaContext *ctx);
uint64_t init_kernel_pf_context(CorunaContext *ctx, uint64_t kernel_base);
uint64_t pf_find_ptov_table(uint64_t idk_ctx); 
uint64_t pf_find_ptov_table_wrapper(uint64_t idk_ctx, int *maybe_PTOV_TABLE_SIZE);
uint64_t read_ptov_table(CorunaContext *ctx);
uint64_t maybe_kvtophys(CorunaContext *ctx, uint64_t virt_addr, uint64_t phys_addr, uint64_t vaddr);
uint64_t maybe_paddr_self_pmap_ttep(CorunaContext *ctx, uint64_t vaddr);
uint64_t maybe_phystokv(CorunaContext *ctx, uint64_t virt_addr, uint64_t phys_addr, uint64_t paddr);
MachOSectionResult get_text_section_info(KctxTargetObj3* kctxto3);
MachOSectionResult maybe_pf_find_early_random(CorunaContext *ctx);
uint64_t get_gPhysBase_gVirtBase_by_patchfinding_invalidate_icache64(KctxTargetObj3 *kctxto3, uint64_t *gVirtBase, uint64_t *gPhysBase);
uint64_t get_gPhysBase_gVirtBase_by_patchfinding_invalidate_icache64_wrapper(CorunaContext *ctx);


uint64_t ptwalk_kvtophys(CorunaContext *ctx, uint64_t vaddr);   //XXX WARNING: PtwalkResult structure's field or local variable name may NOT BE CORRECT!
int maybe_ptwalk_idk(CorunaContext *ctx, uint64_t vaddr, PtwalkResult *result, uint64_t open_null);  //XXX WARNING: PtwalkResult structure's field or local variable name may NOT BE CORRECT!
uint64_t maybe_get_unknown_base_with_shift_val(CorunaContext *ctx, int should_return_zero, uint32_t *shift_val);
uint64_t maybe_calc_unknown_base_with_shift_val(CorunaContext *ctx, uint32_t maybe_idx);
uint64_t maybe_get_backing_copy_c_u_hdr_links_next__or__calculated_vme_object_value__from__vm_named_entry(CorunaContext *ctx, uint64_t named_entry_kobj, bool disable_kread64_vme_object_value);


#endif /* PF_H */
